{
    "Web Application Project" : {
        "date" : "January 2023 - April 2023",
        "tags" : ["Web Development", "Databases", "UX/UI"],
        "group" : "4",
        "members" : {"Tiffany Tran" : "https://github.com/TiffanyT-Ryerson", "Kevin Tran" : "https://github.com/kevinguy28", "Michael Widianto": "https://github.com/michaelrw19"},
        "desc" : "A project done in TMU's CPS630 - Web Applications class. We were tasked to making a shopping website using HTML, CSS, React.js, javascript, php and MySQL. With this application, the users should be able to add items to do tasks such as: add to their cart, checkout, place their order, sign in and sign out, etc.",
        "goals" : {"Create a functional shopping website": ["Create functionalities which allows users to order items: signin/signup, add items to their cart, checkout, place order, view orders", "Add additional functionalities such as: reviewing items, creating sale items, etc."], 
        "Create a working database to hold website information": ["Using SQL, store all the information generated via user actions (ex. placing orders, creating payment card, login information, etc) and default admin controlled information (ex. available items, store locations and information).", "Retrieve and send information between the client application and the database servers."], 
        "Make it a Single Page Application": ["A single page application (SPA) is a website that changes pages using a router, which dynamically rewrites the page with new data instead of reloading the entire page. Using React.js, make the web application a SPA."]},
        "learning" : {"Modelling database into a rational model scheme": ["Special classes were created to represent each table into its own entity.", "This simplifies the process of inserting new entities into the database: when adding to the database, we simply need to create an object and use one simple function to insert it."], "Experience using React.js": ["React.js is a single page application language. Working with useStates. useCookies, etc. was very confusing at first, but simple after practicing.", "Additionally, practicing rerouting and calling get request gave me a thorough understanding of how to use them.", "Setting up the application as a whole on MacOS, working with team member's setup was also tricky and took many tries to make it work."]},
        "status" : "Complete",
        "res" : {
            "languages" : ["HTML", "CSS", "javascript", "jQuery", "React.js", "MySQL", "php", "bootstrap"],
            "host" : ["XAMPP"]
        },
        "images" : ["login.png", "login_failed.png", "homepage_admin.png", "homepage_added_items.png", "homepage_user.png", "sale_page.png", "admin_dbmaintain.png", "shopping_cart.png", "checkout.png", "review_order.png", "review_order_map.png", "order_history.png"]
    },

    "VRulez" : {
        "date" : "October 2019 - February 2020",
        "tags" : ["Web Development", "Content Management System", "UX/UI"],
        "group" : "2",
        "members" : {},
        "desc" : "VRulez is a Virtual Reality Cafe where customers can use machines to play VR games for a set amount of time. The purpose of this website is to provide information about the games available to play, create bookings, and view any information about the company and experience.",
        "goals" : {"Design pages of the website": ["Organize the information in a visual appealing and inuitive way. I was tasked to design the game list page, home page, news page and locations page"], 
        "Create a game list page" : ["Organize all the games into subcategories and display them."]},
        "learning" : {"Experience using Content Management Systems (CMS)": "First experience creating and designing a website: Using a CMS is a good start to learning how to desgin a website's UX and UI. Changing the appearence of every element in a visual way (via drag/drop) is very straight forward.", 
        "Teamwork in a company setting" : "Working with a more experienced co-op student was very helpful when working on a website for a company. We worked together well and shared our ideas for the layout.", 
        "Experience using Wix Code": "Wix code is the language used to customize Wix Component behaviours. This increases the flexibility and functionality of the components added to the website. Wix Code is very similar to javascript, so it made learning javascript easier."},
        "status" : "Complete",
        "res" : {
            "languages" : ["Wix Code"],
            "cms" : ["Wix"]
        },
        "images" : ["home.png", "gamelist.png", "gamelist_expanded.png", "locations.png", "press.png"]
    }
}